#ТОКЕНЫ
token = '8195744063:AAGmE2WPcHg1BEuB7nCxw1Pyx3AA6Wi8_Rs' #Токен бота
api_cryptobot = '404810:AA5xai6hgpwtMdvRJgZmUhm8ITzLHi018vX' # api CryptoBot

#id каналов/чатов
channal_id = -1002626519700 #id игрового канала (Где происходят игры)
ID_SEND_TRANSFER = -1002691756894 #Канал выплат
URL_LOG_CHANNAL = -1002324759887 #id канала логов


#ОБЩЕЕ
ADMIN = [7343705927,7207957044] #id Админов, перечислять через запятую
ADMIN_USERNAME = '@gr1myariv, @fastik727' #@Юзерней админа
URL_BOT = 'https://t.me/LuciFerCasino_bot' #Ссылка на бота
NICNAME = 'LuciFerCasino_bot' #Username бота без @
NAME_CASINO = 'LuciFerCasino' #Название вашего казино


#ЛИМИТЫ И ПРОЦЕНТЫ
LIMIT_STAVKA = 300 #Лимит на max ставку
lose_withdraw = 0.2 #Процент реферальной программы
min_stavka_referal = 10 #Это минимальная сумма ставки для того чтобы получить деньги с реферала
CASHBACK_PROCENT = 1 #Процент кэшбэка от ставки при проигрыше
CASHBACK_LIMIT = 5 #От какой суммы ставки предоставляется кэшбэк
PROCENT_DRAW = 10 #Процент комиссии за ничью
PROCENT_NOT_GAME = 10 #Процент за комиссию при привышении макс ставки или не указания коментария к платежу
TIMER = 125 #Указываем время в секундах в какое n время будет играть фейк ставка когда она будет включена через админ меню, рекомендуемое значение 40 секунд



#Фейк ставки
FAKE_NICKNAME = ['KARL', 'Alina', 'Кто то', 'Лудик', 'Маша', 'M**ks', '😈', 'Панфилов', 'Аркадий', 'Паровозов', 'Евгений', 'Макс [Check Bio]', 'Дориан', 'Карим', 'Алфей', 'zzzzzz', 'Ya Kay💸','ОпАSнЫй ВоЗрАSт','K♚I♚N♚G','>>¥¥♔Limbo♔¥¥<<','Cr1stal','Lemon4ik','ǤⒽǿⓈ†','⚡💥BlanderBot💥⚡','Ďęмøņ','3Jlou_4uTep','♠V1RUS♠','ĶpĀčĀB4úĶ','▀▄▀▄▀▄ FINISH ▀▄▀▄▀▄','Утка_в_тапках','† СтРеЛоК †','Fluffy','ℳ∑Đ\/Ē๖ۣۣۜD†₤₮','©ßЯ†ØÑ','|Power|™4ekHyTblu NigGa','ĢắḾ£ℝ','He}I{g@H4uk','Mr. Zadrot','Haker♡ˢᶜᵃʳ','W1zarD','Ҕøрзǻя','_LegenDa_','JoKeR :D','Злобный_бульбулятор','Sa[Y]reX','Шаман-наркоман','AnGeL','Agressor','KiSS_Ka','☜❶☞★No_i★☜❶☞','KoTuk','D_O_M_I_N_A_T_O_R','Ǻρélṧîηќά','CJIoHuK','IceStorm','KukU EpTA','ңEңÄвÜçTѣ','₦ɨ₭€','DoNaT1k','Высоковольтный Майонез','LIJyXeP','Доктор Вазелин','Kak_TaK?','N.E.O.N','Девчонка в наушниках','Vitaminka','Red_Wolf_777','H@rk0Tik','В_КеДАхХх ↑','CmeTanKa','Mirrox','Aim41K','ShOoTeR','MaJIeHkuu_Ho_BeJIuKuu','☆Zigzag☆','3aHo3a','LiMon4k','Ceme4ka','SmoKKeR','Lиsичка','Летучий Олень','Nessa','N.E.V.E.N','G.R.I.Z.Z.L.I','AliceFox','I ♥ Cmpaх','ZikZak','4и®КаШ','АНТИ ПЕТУХ','çМePтѢ','¤πтими¢т','DIVERSANT_95','Mr.Negotive','-_-RuBiX-_','Beep Beep I’am Jeep','JIuMoH4eG','Enigma','AņťůMýđäķ','-=HarDcore=-','XuMuK','çŤᵱẮχ','3JIou_4uTeP','I am LEGENDA☢❁','K_I_N_G','pr!zrak?!','Сын_Маминой_Подруги','Cherry','Mr.GameFun','l7ocJleDHuu_CaMyPau','MANDARIN','^|^NEOбычный(~)GUсь','FeNiKs','Foxy_[P]i]r]a]t]e]','DēFSťrøļķ','ᛖ ০ ρ я ҡ','Эрагон','SkILLzAr','RUDI','Следующая остановка – сердце','Black_Wolf','GaRDeX','Magic','çМеLöÇтѢ','Good_Joker','KyKyPy3a','Это_Недоразумение','4eJIoBeK','Чучундра','-k0FFe-','IIo3uTuB_Ha_M|/|H|/|MyM','Revers','Ромашка_с_ядом'] #Фейк ники
DIAPAZONE_AMOUNT = [2.50, 19.50] #Диапозон сумм фейк ставки


#////////////////////////////////Ключевые слова. НЕ ТРОГАТЬ\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#Кости
Bones = ['Больше', 'Меньше', '1', '2', '3', '4', '5', '6', 'Пвп', 'Ничья', 'Равно', 'Дуэль', '2М', '2Б', '2 Больше', '2 Меньше', 'Чет', 'Нечет']

#Слоты
Slots = ['Слоты']

#Баскетбол
Basketball = ['Баскетбол Гол', 'Баскет Гол', 'Баскетбол Мимо', 'Баскет Мимо']

#Футбол
Fotbool = ['Футбол Гол', 'Фут Гол', 'Футбол Мимо', 'Фут Мимо']

#Камень,Ножницы,Бумага
SU_E_FA = ['Камень', 'Ножницы', 'Бумага']


#Колесо
WHEEL = ['Красное', 'Черное', 'Зеленое']


all_text = ['Больше', 'Меньше', '1', '2', '3', '4', '5', '6', 'Пвп', 'Дуэль', '2М', '2Б', '2 Больше', '2 Меньше', 'Чет', 'Нечет',
            'Слоты', 'Баскетбол Гол', 'Красное', 'Черное', 'Зеленое', 'Баскет Гол', 'Ничья', 'Равно', 'Баскетбол Мимо', 'Баскет Мимо', 'Футбол Гол', 'Фут Гол', 'Футбол Мимо', 'Фут Мимо', 'Камень', 'Ножницы', 'Бумага']

#Красные/Черные/Зеленое
RED = ['1', '2', '3', '4', '5', '6', '7']

BLACK = ['8', '9', '10', '11', '12', '13', '14']

GREEN = '0'

